<script setup lang="ts">
import HeaderH1 from '@/components/HeaderH1.vue'
import PH2 from '@/components/ParagraphH2.vue'
</script>

<template>
  <header-h1>OverscrollBehavior</header-h1>
  <!-- 用于控制浏览器到达滚动区域边界时的行为方式 -->
  <p-h2>防止父级过度滚动</p-h2>
  <!--
  使用 overscroll-contain 可防止目标区域中的滚动触发父元素中的滚动，
  但在支持它的操作系统中滚动到容器末尾时保留“反弹”效果。 
  -->
  <div class="mx-auto h-64 max-w-xl overflow-auto overscroll-contain border bg-slate-50 shadow">
    春江花月夜 <br />
    张若虚〔唐代〕 <br />
    春江潮水连海平，海上明月共潮生。 <br />
    滟滟随波千万里，何处春江无月明。 <br />
    江流宛转绕芳甸，月照花林皆似霰。 <br />
    空里流霜不觉飞，汀上白沙看不见。 <br />
    江天一色无纤尘，皎皎空中孤月轮。 <br />
    江畔何人初见月？江月何年初照人？ <br />
    人生代代无穷已，江月年年望相似。(望相似 一作：只相似) <br />
    不知江月待何人，但见长江送流水。 <br />
    白云一片去悠悠，青枫浦上不胜愁。 <br />
    谁家今夜扁舟子？何处相思明月楼？ <br />
    可怜楼上月裴回，应照离人妆镜台。(裴回 一作：徘徊) <br />
    玉户帘中卷不去，捣衣砧上拂还来。 <br />
    此时相望不相闻，愿逐月华流照君。 <br />
    鸿雁长飞光不度，鱼龙潜跃水成文。 <br />
    昨夜闲潭梦落花，可怜春半不还家。 <br />
    江水流春去欲尽，江潭落月复西斜。 <br />
    斜月沉沉藏海雾，碣石潇湘无限路。 <br />
    不知乘月几人归，落月摇情满江树。(落月 一作：落花)
  </div>

  <p-h2>防止过度滚动弹跳</p-h2>
  <!-- 
  使用 overscroll-none 可防止目标区域的滚动触发父元素中的滚动，
  还可防止滚动超过容器末尾时出现“反弹”效果。 
  -->
  <div class="mx-auto h-64 max-w-xl overflow-auto overscroll-none border bg-slate-50 shadow">
    春江花月夜 <br />
    张若虚〔唐代〕 <br />
    春江潮水连海平，海上明月共潮生。 <br />
    滟滟随波千万里，何处春江无月明。 <br />
    江流宛转绕芳甸，月照花林皆似霰。 <br />
    空里流霜不觉飞，汀上白沙看不见。 <br />
    江天一色无纤尘，皎皎空中孤月轮。 <br />
    江畔何人初见月？江月何年初照人？ <br />
    人生代代无穷已，江月年年望相似。(望相似 一作：只相似) <br />
    不知江月待何人，但见长江送流水。 <br />
    白云一片去悠悠，青枫浦上不胜愁。 <br />
    谁家今夜扁舟子？何处相思明月楼？ <br />
    可怜楼上月裴回，应照离人妆镜台。(裴回 一作：徘徊) <br />
    玉户帘中卷不去，捣衣砧上拂还来。 <br />
    此时相望不相闻，愿逐月华流照君。 <br />
    鸿雁长飞光不度，鱼龙潜跃水成文。 <br />
    昨夜闲潭梦落花，可怜春半不还家。 <br />
    江水流春去欲尽，江潭落月复西斜。 <br />
    斜月沉沉藏海雾，碣石潇湘无限路。 <br />
    不知乘月几人归，落月摇情满江树。(落月 一作：落花)
  </div>
  <p-h2>使用默认的滚动行为</p-h2>
  <!-- 使用该overscroll-auto实用程序使用户在到达主滚动区域边界时能够继续滚动父滚动区域。-->
  <div class="mx-auto h-64 max-w-xl overflow-auto overscroll-none border bg-slate-50 shadow">
    春江花月夜 <br />
    张若虚〔唐代〕 <br />
    春江潮水连海平，海上明月共潮生。 <br />
    滟滟随波千万里，何处春江无月明。 <br />
    江流宛转绕芳甸，月照花林皆似霰。 <br />
    空里流霜不觉飞，汀上白沙看不见。 <br />
    江天一色无纤尘，皎皎空中孤月轮。 <br />
    江畔何人初见月？江月何年初照人？ <br />
    人生代代无穷已，江月年年望相似。(望相似 一作：只相似) <br />
    不知江月待何人，但见长江送流水。 <br />
    白云一片去悠悠，青枫浦上不胜愁。 <br />
    谁家今夜扁舟子？何处相思明月楼？ <br />
    可怜楼上月裴回，应照离人妆镜台。(裴回 一作：徘徊) <br />
    玉户帘中卷不去，捣衣砧上拂还来。 <br />
    此时相望不相闻，愿逐月华流照君。 <br />
    鸿雁长飞光不度，鱼龙潜跃水成文。 <br />
    昨夜闲潭梦落花，可怜春半不还家。 <br />
    江水流春去欲尽，江潭落月复西斜。 <br />
    斜月沉沉藏海雾，碣石潇湘无限路。 <br />
    不知乘月几人归，落月摇情满江树。(落月 一作：落花)
  </div>
  <p-h2>未起作用</p-h2>
</template>

<style scoped>
@import 'tailwindcss/tailwind.css';
</style>
